## Desafío

Encontrar y eliminar las filas que contienen valores nulos dentro de nuestro dataframe.

## Librerías

In [1]:
import pandas as pd

## Lectura de datos

In [2]:
df = pd.read_csv('empleados.csv', sep=';')
df.head()

,Nombre,Apellido,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
0,Alexandro,NaN,Masculino,Soltero(a),22.0,3.0,2423.0,No,Publicidad
1,Carlos,NaN,Masculino,Casado(a),38.0,10.0,3132.0,Sí,NaN
2,Felipa,NaN,Femenino,Soltero(a),26.0,5.0,2639.0,No,Comercial
3,Daniel,NaN,Masculino,Casado(a),35.0,10.0,3122.0,No,Comercial
4,John,NaN,Masculino,Casado(a),35.0,13.0,3431.0,Sí,Servicios al cliente

In [3]:
df = df.drop('Apellido', axis=1)

## Solución

In [4]:
# Filas con valores nulos
filasConNulos = df[df.isnull().any(axis=1)]
print(filasConNulos)

     Nombre       Sexo   Estado_Civil  Edad  Experiencia  Salario Gerencia  \
1    Carlos  Masculino      Casado(a)  38.0         10.0   3132.0       Sí
5    Edward  Masculino     Soltero(a)   NaN          NaN   4500.0       No
7     Amaya   Femenino  Divorciado(a)  22.0          3.0   2450.0      NaN
10     Febe   Femenino      Casado(a)  44.0         22.0   4359.0       No
15      NaN   Femenino            NaN  44.0         22.0      NaN      NaN
..      ...        ...            ...   ...          ...      ...      ...
241  Robert        NaN     Soltero(a)  33.0         11.0   3267.0       No
242   Kevin        NaN  Divorciado(a)   NaN         20.0   4166.0       No
243   Amaro  Masculino      Casado(a)   NaN         24.0   4510.0       No
248    Eric        NaN      Casado(a)  25.0          7.0   2880.0       Sí
249    Marc        NaN      Casado(a)  24.0          2.0   2172.0       No

         Departamento
1                 NaN
5               Legal
7           Comercial
10                NaN
15                NaN
..                ...
241  Recursos Humanos
242          Finanzas
243         Comercial
248  Recursos Humanos
249          Producto

[106 rows x 8 columns]

In [5]:
# Eliminar filas con valores nulos
df.dropna(inplace=True)

In [6]:
df.shape

(145, 8)